# GetLightDistributionStyle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightFamily..::..GetLightDistributionStyle Method
LightFamily Class See Also
---
Returns a LightDistributionStyle value for the light distribution
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LightDistributionStyle GetLightDistributionStyle()
```

Visual Basic
---
```text
Public Function GetLightDistributionStyle As LightDistributionStyle
```

Visual C++
---
```text
public:
LightDistributionStyle GetLightDistributionStyle()
```

# See Also
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace